Repository: andeerlb/letsplay
Catalog: locales/*/messages.po
Languages: pt

# screen.signup.more-sports.step-position
source: Nice! And in {selectedGame}, which position do you play?
pt: Show! E no <0>{0}</0>, você joga em qual posição?

# component.fut11-position-card.attacking_midfielder
source: Attacking Midfielder
pt: Meio-Campo Ofensivo

# component.fut11-position-card.attacking_midfielder.description
source: Creates plays and pushes the attack with creativity.
pt: Cria jogadas e chega ao ataque com criatividade.

# component.fut11-position-card.center_back
source: Center Back
pt: Zagueiro Central

# component.fut11-position-card.center_back.description
source: Defends with strength and positioning. Pillar of defense.
pt: Defende com força e posicionamento. Pilar da defesa.

# component.fut11-position-card.center_forward
source: Center Forward
pt: Centroavante

# component.fut11-position-card.center_forward.description
source: Offensive reference, plays with back to goal and finishes.
pt: Referência ofensiva, joga de costas para o gol e finaliza.

# component.fut11-position-card.central_midfielder
source: Central Midfielder
pt: Meio-Campo Central

# component.fut11-position-card.central_midfielder.description
source: Controls midfield, organizes the game and sets the rhythm.
pt: Controla o meio campo, organiza o jogo e dá ritmo.

# component.fut11-position-card.defensive_midfielder
source: Defensive Midfielder
pt: Volante

# component.fut11-position-card.defensive_midfielder.description
source: Protects defense and distributes the ball intelligently.
pt: Protege a defesa e distribui o jogo com inteligência.

# component.fut11-position-card.goalkeeper
source: Goalkeeper
pt: Goleiro

# component.fut11-position-card.goalkeeper.description
source: Guards the goal with quick reflexes and defensive leadership.
pt: Guarda o gol com reflexos rápidos e liderança defensiva.

# component.fut11-position-card.left_back
source: Left Back
pt: Lateral Esquerdo

# component.fut11-position-card.left_back.description
source: Advances quickly on the left and defends firmly.
pt: Avança com velocidade pela esquerda e marca com firmeza.

# component.fut11-position-card.left_winger
source: Left Winger
pt: Ponta Esquerda

# component.fut11-position-card.left_winger.description
source: Dribbles and shoots cutting in from the left.
pt: Dribla e finaliza cortando da esquerda.

# component.fut11-position-card.right_back
source: Right Back
pt: Lateral Direito

# component.fut11-position-card.right_back.description
source: Supports the attack and recovers defense on the right side.
pt: Apoia o ataque e recompõe na defesa pelo lado direito.

# component.fut11-position-card.right_winger
source: Right Winger
pt: Ponta Direita

# component.fut11-position-card.right_winger.description
source: Attacks with speed and delivers dangerous crosses.
pt: Ataca com velocidade e cruza bolas perigosas.

# component.fut11-position-card.striker
source: Striker
pt: Atacante

# component.fut11-position-card.striker.description
source: Main goal scorer, leads the attack and finishes chances.
pt: Finaliza com precisão e posicionamento cirúrgico.

# component.fut7-position-card.fixo
source: Fix
pt: Fixo

# component.fut7-position-card.fixo.description
source: Defensive anchor who organizes the back line.
pt: Responsável por proteger a defesa e iniciar as jogadas. Forte na marcação e no posicionamento.

# component.fut7-position-card.goalkeeper
source: Goalkeeper
pt: Goleiro

# component.fut7-position-card.goalkeeper.description
source: Protects the goal with quick reflexes and leadership.
pt: Defende o gol e organiza a defesa. Reflexos rápidos e liderança.

# component.fut7-position-card.left-wing
source: Left Wing
pt: Ala Esquerda

# component.fut7-position-card.left-wing.description
source: Attacks down the left flank with speed and skill.
pt: Atua pela esquerda com dribles e criatividade. Importante no ataque e na marcação lateral.

# component.fut7-position-card.midfielder
source: Midfielder
pt: Meio-Campo

# component.fut7-position-card.midfielder.description
source: Controls the midfield and links defense and attack.
pt: Controla o ritmo do jogo, distribui passes e apoia tanto o ataque quanto a defesa.

# component.fut7-position-card.pivot
source: Pivot
pt: Pivô

# component.fut7-position-card.pivot.description
source: Central attacker who holds the ball and creates chances.
pt: Referência no ataque. Recebe de costas para o gol, protege a bola e finaliza com precisão.

# component.fut7-position-card.right-wing
source: Right Wing
pt: Ala Direita

# component.fut7-position-card.right-wing.description
source: Attacks down the right flank with speed and skill.
pt: Velocidade e apoio ofensivo pela direita. Crucial para cruzamentos e recomposição defensiva.

# component.futsal-position-card.fixo
source: Fix
pt: Fixo

# component.futsal-position-card.fixo.description
source: Defensive player who organizes the defense.
pt: Último homem da defesa, organiza o time e inicia a saída de bola.

# component.futsal-position-card.goalkeeper
source: Goalkeeper
pt: Goleiro

# component.futsal-position-card.goalkeeper.description
source: Guards the goal with quick reflexes.
pt: Defende o gol e comanda a linha defensiva. Usa muito os pés no jogo.

# component.futsal-position-card.left_wing
source: Left Wing
pt: Ala Esquerda

# component.futsal-position-card.left_wing.description
source: Attacks quickly and crosses from the left side.
pt: Driblador e criativo, cria jogadas pela esquerda com intensidade.

# component.futsal-position-card.pivot
source: Pivot
pt: Pivô

# component.futsal-position-card.pivot.description
source: Central attacker who holds the ball and creates scoring chances.
pt: Referência ofensiva, joga de costas para o gol e finaliza com precisão.

# component.futsal-position-card.right_wing
source: Right Wing
pt: Ala Direita

# component.futsal-position-card.right_wing.description
source: Attacks quickly and crosses from the right side.
pt: Rápido e habilidoso, atua pelo lado direito em ataque e defesa.

# component.input-email.placeholder
source: example@email.com
pt: exemplo@email.com

# component.select.cancel
source: Cancel
pt: Cancelar

# component.select.placeholder
source: Select an option
pt: Selecione uma opção

# player.position.attacking-midfielder
source: Attacking Midfielder
pt: Meia Atacante

# player.position.center-back
source: Center Back
pt: Zagueiro Central

# player.position.central-midfielder
source: Central Midfielder
pt: Meia Central

# player.position.defensive-midfielder
source: Defensive Midfielder
pt: Volante

# player.position.goalkeeper
source: Goalkeeper
pt: Goleiro

# player.position.left-back
source: Left Back
pt: Lateral Esquerdo

# player.position.left-wing
source: Left Wing
pt: Ponta Esquerda

# player.position.left-winger
source: Left Winger
pt: Ponta Esquerda

# player.position.midfielder
source: Midfielder
pt: Meia

# player.position.pivot
source: Pivot
pt: Pivô

# player.position.right-back
source: Right Back
pt: Lateral Direito

# player.position.right-wing
source: Right Wing
pt: Ponta Direita

# player.position.right-winger
source: Right Winger
pt: Ponta Direita

# player.position.second-striker
source: Second Striker
pt: Segundo Atacante

# player.position.striker
source: Striker
pt: Centroavante

# screen.home.title
source: Home
pt: Início

# screen.home.welcome
source: Welcome
pt: Bem-vindo

# screen.match.title
source: Search
pt: Buscar

# screen.profile.given-name
source: First Name
pt: Nome

# screen.profile.nickname
source: Nickname
pt: Apelido

# screen.profile.surname
source: Last Name
pt: Sobrenome

# screen.profile.title
source: Account
pt: Conta

# screen.setting.appearance
source: Appearance
pt: Visual

# screen.setting.language
source: Language
pt: Idioma

# screen.setting.language.english
source: English
pt: Inglês

# screen.setting.language.portuguese
source: Portuguese
pt: Português

# screen.setting.theme
source: Theme
pt: Tema

# screen.setting.theme.dark
source: Dark
pt: Escuro

# screen.setting.theme.light
source: Light
pt: Claro

# screen.setting.theme.system
source: System
pt: Sistema

# screen.setting.title
source: Settings
pt: Configurações

# screen.signin.btn-sigin
source: Sign In
pt: Entrar

# screen.signin.description
source: Sign in to your account to continue
pt: Entre na sua conta para continuar

# screen.signin.forgot
source: Forgot password?
pt: Esqueceu a senha?

# screen.signin.invalid-grant
source: Invalid username or password
pt: Usuário ou senha inválido(s)

# screen.signin.noaccount
source: Don't have an account?
pt: Não tem uma conta?

# screen.signin.password
source: Password
pt: Senha

# screen.signin.signup
source: Create Account
pt: Criar conta

# screen.signin.user
source: Username
pt: Usuário

# screen.signin.welcome
source: Welcome
pt: Bem-vindo

# screen.signup.birthday
source: Birthdate
pt: Data de nascimento

# screen.signup.credentials.confirm-password
source: Confirm your password
pt: Confirma tua senha

# screen.signup.credentials.description
source: Create your username and password to secure your spot on the team
pt: Crie seu usuário e senha para garantir seu lugar no time

# screen.signup.credentials.register
source: Let’s play!
pt: Bora jogar!

# screen.signup.credentials.title
source: Final step, champ!
pt: Última etapa, campeão!

# screen.signup.given-name
source: First Name
pt: Nome

# screen.signup.more-sports.choose-another-button
source: Pick another one!
pt: Bora escolher outro!

# screen.signup.more-sports.step-another-ask
source: Wanna pick another sport or move on to the next step?
pt: Quer escolher mais um jogo ou bora pro próximo passo?

# screen.signup.more-sports.step-another-end
source: You crushed it, legend! All sports selected! 🚀⚽
pt: Você tá voando, craque! Todos os jogos já selecionados! 🚀⚽

# screen.signup.more-sports.step-game
source: Tell us—are you into any other games
pt: Agora conta aí: encara outro jogo também?

# screen.signup.more-sports.title
source: You’re on fire
pt: Top demais

# screen.signup.next
source: Next
pt: Continuar

# screen.signup.person.title
source: We want to know you
pt: Queremos te conhecer

# screen.signup.sport.description.beginner
source: Just starting out, trying to look good — even when the ball gets away!
pt: Começando agora, mas já tentando fazer bonito — mesmo que a bola escape às vezes!

# screen.signup.sport.description.intermediate
source: Been in the game for a while, with sharp skills and hungry for the next level.
pt: Na pista há um tempo, com a técnica afiada e vontade de chegar no próximo nível.

# screen.signup.sport.description.intermediate-advanced
source: Somewhere between hustle and wisdom — I've seen some ball!
pt: Entre a raça de sempre e a sabedoria de quem já viveu muita bola.

# screen.signup.sport.description.veteran
source: Maybe slower... but every move counts. Like fine wine — only better with time.
pt: Talvez mais lento… mas cada passo é pensado. Tipo vinho: só melhora.

# screen.signup.sport.game-type.fut11
source: 11-a-side Football
pt: Futebol 11

# screen.signup.sport.game-type.fut7
source: 7-a-side Football
pt: Futebol 7

# screen.signup.sport.game-types
source: Choose the game type
pt: Escolha o tipo de jogo

# screen.signup.sport.select-your-position
source: Select your position
pt: Qual posição você joga?

# screen.signup.surname
source: Last Name
pt: Sobrenome

# screen.team.add
source: Add Team
pt: Adicionar time

# screen.team.search-placeholder
source: My teams...
pt: Meus times...

# screen.team.title
source: Teams
pt: Times

# screen.welcome.description
source: Manage your team, track matches, and chase victories.
pt: Gerencie seu time, acompanhe partidas e conquiste vitórias.

# screen.welcome.manage.desc
source: Organize players and positions
pt: Organize jogadores e posições

# screen.welcome.manage.title
source: Team Management
pt: Gerir Equipe

# screen.welcome.stats.desc
source: Track your stats
pt: Acompanhe estatísticas

# screen.welcome.stats.title
source: Stats
pt: Estatísticas

# screen.welcome.team.desc
source: Schedule practices and matches
pt: Marque treinos e jogos

# screen.welcome.team.title
source: Manage Team
pt: Gerir equipe

# screens.signup.person.description
source: We're glad you're here! Let's get to know you — your position, your player name, and more. Ready?
pt: Que bom que você chegou aqui, queremos te conhecer, saber qual posição joga, qual seu nome de jogador e outras coisas, vamos lá?

# welcome.screen.schedule.desc
source: Schedule practices and matches
pt: Marque treinos e jogos

# welcome.screen.schedule.title
source: Schedule
pt: Agendar

# welcome.screen.signin
source: I already have an account
pt: Já tenho uma conta

# welcome.screen.signup
source: Get Started
pt: Começar agora
